<a href="https://colab.research.google.com/github/mkmritunjay/machineLearning/blob/master/pandas_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Basics

Pandas is a software library in python for data manipulation and analysis. The name is derived from the term "panel data".

The two primary data structures of pandas are Series (1-dimensional) and DataFrame (2-dimensional).

### Series:

***pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)***



Its a one dimentional ndarray with axis labels (including time series).

Lets create a series and do some basic operations.

In [ ]:
import pandas as pd

list_1 = [1,2,3,4,5]
tuple_1 = (1,2,3,4,5)

series_1 = pd.Series(data=list_1)
series_2 = pd.Series(data=tuple_1)

print("List Series:")
print(series_1)
print("\nTuple Series:\n")
print(series_2)

List Series:
0    1
1    2
2    3
3    4
4    5
dtype: int64

Tuple Series:

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Dataframe:

***pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)***

Its a two-dimensional mutable, heterogeneous tabular data structure with labeled axes (rows and columns).

Lets create a dataframe and do some basic operations.

In [ ]:
df_dict_1 = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
             {'a': 10, 'b': 20, 'c': 30, 'd': 40},
              {'a': 100, 'b': 200, 'c': 300, 'd': 400},
                {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]

df_1 = pd.DataFrame(df_dict_1)

df_1

      a     b     c     d
0     1     2     3     4
1    10    20    30    40
2   100   200   300   400
3  1000  2000  3000  4000

#### Selecting rows and columns of a dataframe:

loc and iloc are widely used to fetch rows and columns from a dataframe.

iloc is purely integer-location based indexing for selection by position. While selection through iloc start and (stop-1) are fetched. Below are some of the allowed inputs for iloc:

1. An integer, (series.iloc[5])

2. A list or array of integers, (series.iloc[[0,1]])

3. A slice object with ints, (series.iloc[1:5])

4. A boolean array, (series.iloc[True,False,True])

In [ ]:
# selection using an integer
print("using integers")
print(df_1.iloc[0]) # this fetches all columns of row 1

using integers
a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [ ]:
#to fetch specific columns use comma"," (left side of comma specify rows index and right side columns index)
print("\nspecific columns using integers\n")
print(df_1.iloc[0,1])

specific columns using integers

2

In [ ]:
# selection using an array of integers
print("\nspecific columns using arrays of integers\n")
print(df_1.iloc[[0,1],[2,3]])

specific columns using arrays of integers

    c   d
0   3   4
1  30  40

In [ ]:
# slice object with ints
print("\nslice\n")
print(df_1.iloc[0:2,1:3])

slice

    b   c
0   2   3
1  20  30

In [ ]:
# some more examples
print(df_1.iloc[0:2,[0,3]])
print("\n\n")
print(df_1.iloc[[0,2],0:3])
print("\n\n")
print(df_1['a'])
print("\n\n")
print(df_1[['a','b']])

    a   d
0   1   4
1  10  40



     a    b    c
0    1    2    3
2  100  200  300



0       1
1      10
2     100
3    1000
Name: a, dtype: int64



      a     b
0     1     2
1    10    20
2   100   200
3  1000  2000

loc is purely label-location based indexer for selection by label. While selection through loc both the start and the stop are fetched. Below are some of the allowed inputs for loc:

1. A single label, e.g. (series.loc[5]) or (series.loc['label']), (note that 5 is interpreted as a label of the index, and never as an integer position along the index).

2. A list or array of labels, (series.loc['a', 'b', 'c']).

3. A slice object with labels, (series.loc['a':'f']).

4. A boolean array of the same length as the axis being sliced, (series.loc[True, False, True].)

In [ ]:
# selection using a single label
print(df_1.loc[:,'a']) # this fetches all rows of column 'a'

0       1
1      10
2     100
3    1000
Name: a, dtype: int64

In [ ]:
# selection using array of labels
print(df_1.loc[:,['a','b']]) # this fetches all rows of column 'a' and 'b'

      a     b
0     1     2
1    10    20
2   100   200
3  1000  2000

In [ ]:
# selecting a slice
print(df_1.loc[2:3,'a':'c']) # this fetches row 2 to 3 and columns 'a' to 'c'

      a     b     c
2   100   200   300
3  1000  2000  3000

### Adding new column (Single)

In [ ]:
df_1['diff'] = df_1['a'] - df_1['b']
df_1

      a     b     c     d  diff
0     1     2     3     4    -1
1    10    20    30    40   -10
2   100   200   300   400  -100
3  1000  2000  3000  4000 -1000

In [ ]:
df_1['new_diff'] = df_1.a - df_1.c
df_1

      a     b     c     d  diff  new_diff
0     1     2     3     4    -1        -2
1    10    20    30    40   -10       -20
2   100   200   300   400  -100      -200
3  1000  2000  3000  4000 -1000     -2000

### Adding new column (Multiple)

In [ ]:
df_1 = df_1.assign(add_mul1=df_1['a'] + df_1['b'], add_mul2=df_1['a'] + df_1['c'])
df_1

      a     b     c     d  diff  new_diff  add_mul1  add_mul2
0     1     2     3     4    -1        -2         3         4
1    10    20    30    40   -10       -20        30        40
2   100   200   300   400  -100      -200       300       400
3  1000  2000  3000  4000 -1000     -2000      3000      4000

### Renaming columns

In [ ]:
df_1 = df_1.rename(columns={'diff':'renamed_1','new_diff':'renamed_2','add_mul1':'renamed_3','add_mul2':'renamed_4'})
df_1

      a     b     c     d  renamed_1  renamed_2  renamed_3  renamed_4
0     1     2     3     4         -1         -2          3          4
1    10    20    30    40        -10        -20         30         40
2   100   200   300   400       -100       -200        300        400
3  1000  2000  3000  4000      -1000      -2000       3000       4000

### Delete a column

In [ ]:
del df_1['renamed_4']
df_1

      a     b     c     d  renamed_1  renamed_2  renamed_3
0     1     2     3     4         -1         -2          3
1    10    20    30    40        -10        -20         30
2   100   200   300   400       -100       -200        300
3  1000  2000  3000  4000      -1000      -2000       3000

In [ ]:
# Missing value treatment

In [ ]:
import pandas as pd
url = 'https://raw.githubusercontent.com/mkmritunjay/machineLearning/master/Car_sales.csv'
car_sales = pd.read_csv(url)

In [ ]:
car_sales.head(10)

  Manufacturer    Model  ...  Latest_Launch  Power_perf_factor
0        Acura  Integra  ...       2/2/2012          58.280150
1        Acura       TL  ...       6/3/2011          91.370778
2        Acura       CL  ...       1/4/2012                NaN
3        Acura       RL  ...      3/10/2011          91.389779
4         Audi       A4  ...      10/8/2011          62.777639
5         Audi       A6  ...       8/9/2011          84.565105
6         Audi       A8  ...      2/27/2012         134.656858
7          BMW     323i  ...      6/28/2011          71.191207
8          BMW     328i  ...      1/29/2012          81.877069
9          BMW     528i  ...       4/4/2011          83.998724

[10 rows x 16 columns]

In [ ]:
car_sales.describe()

       Sales_in_thousands  ...  Power_perf_factor
count          157.000000  ...         155.000000
mean            52.998076  ...          77.043591
std             68.029422  ...          25.142664
min              0.110000  ...          23.276272
25%             14.114000  ...          60.407707
50%             29.450000  ...          72.030917
75%             67.956000  ...          89.414878
max            540.561000  ...         188.144323

[8 rows x 12 columns]

In [ ]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Manufacturer            157 non-null    object
 1   Model                   157 non-null    object
 2   Sales_in_thousands      157 non-null    float64
 3   four_year_resale_value  121 non-null    float64
 4   Vehicle_type            157 non-null    object
 5   Price_in_thousands      155 non-null    float64
 6   Engine_size             156 non-null    float64
 7   Horsepower              156 non-null    float64
 8   Wheelbase               156 non-null    float64
 9   Width                   156 non-null    float64
 10  Length                  156 non-null    float64
 11  Curb_weight             155 non-null    float64
 12  Fuel_capacity           156 non-null    float64
 13  Fuel_efficiency         154 non-null    float64
 14  Latest_Launch           157 non-null    object
 15  Power_perf_factor       155 non-null    float64
dtypes: float64(12), object(4)
memory usage: 19.8+ KB

In [ ]:
car_sales["four_year_resale_value"].isna()

0      False
1      False
2      False
3      False
4      False
       ...
152     True
153     True
154     True
155     True
156     True
Name: four_year_resale_value, Length: 157, dtype: bool

In [ ]:
# get the missing data count
car_sales.isnull().sum()

Manufacturer               0
Model                      0
Sales_in_thousands         0
four_year_resale_value    36
Vehicle_type               0
Price_in_thousands         2
Engine_size                1
Horsepower                 1
Wheelbase                  1
Width                      1
Length                     1
Curb_weight                2
Fuel_capacity              1
Fuel_efficiency            3
Latest_Launch              0
Power_perf_factor          2
dtype: int64

In [ ]:
# Filling missing data
# Forward fill
car_sales.fillna(method='ffill') # replicates last filled row to all bottom missing rows

    Manufacturer    Model  ...  Latest_Launch  Power_perf_factor
0          Acura  Integra  ...       2/2/2012          58.280150
1          Acura       TL  ...       6/3/2011          91.370778
2          Acura       CL  ...       1/4/2012          91.370778
3          Acura       RL  ...      3/10/2011          91.389779
4           Audi       A4  ...      10/8/2011          62.777639
..           ...      ...  ...            ...                ...
152        Volvo      V40  ...      9/21/2011          66.498812
153        Volvo      S70  ...     11/24/2012          70.654495
154        Volvo      V70  ...      6/25/2011          71.155978
155        Volvo      C70  ...      4/26/2011         101.623357
156        Volvo      S80  ...     11/14/2011          85.735655

[157 rows x 16 columns]

In [ ]:
# backward fill
car_sales.fillna(method='bfill') # replicates last filled row from bottom to all its above missing rows

    Manufacturer    Model  ...  Latest_Launch  Power_perf_factor
0          Acura  Integra  ...       2/2/2012          58.280150
1          Acura       TL  ...       6/3/2011          91.370778
2          Acura       CL  ...       1/4/2012          91.389779
3          Acura       RL  ...      3/10/2011          91.389779
4           Audi       A4  ...      10/8/2011          62.777639
..           ...      ...  ...            ...                ...
152        Volvo      V40  ...      9/21/2011          66.498812
153        Volvo      S70  ...     11/24/2012          70.654495
154        Volvo      V70  ...      6/25/2011          71.155978
155        Volvo      C70  ...      4/26/2011         101.623357
156        Volvo      S80  ...     11/14/2011          85.735655

[157 rows x 16 columns]

In [ ]:
# Linear interpolation
car_sales.interpolate()

    Manufacturer    Model  ...  Latest_Launch  Power_perf_factor
0          Acura  Integra  ...       2/2/2012          58.280150
1          Acura       TL  ...       6/3/2011          91.370778
2          Acura       CL  ...       1/4/2012          91.380278
3          Acura       RL  ...      3/10/2011          91.389779
4           Audi       A4  ...      10/8/2011          62.777639
..           ...      ...  ...            ...                ...
152        Volvo      V40  ...      9/21/2011          66.498812
153        Volvo      S70  ...     11/24/2012          70.654495
154        Volvo      V70  ...      6/25/2011          71.155978
155        Volvo      C70  ...      4/26/2011         101.623357
156        Volvo      S80  ...     11/14/2011          85.735655

[157 rows x 16 columns]

In [ ]:
# pchip interpolation
car_sales.interpolate(method='pchip')

    Manufacturer    Model  ...  Latest_Launch  Power_perf_factor
0          Acura  Integra  ...       2/2/2012          58.280150
1          Acura       TL  ...       6/3/2011          91.370778
2          Acura       CL  ...       1/4/2012          91.385621
3          Acura       RL  ...      3/10/2011          91.389779
4           Audi       A4  ...      10/8/2011          62.777639
..           ...      ...  ...            ...                ...
152        Volvo      V40  ...      9/21/2011          66.498812
153        Volvo      S70  ...     11/24/2012          70.654495
154        Volvo      V70  ...      6/25/2011          71.155978
155        Volvo      C70  ...      4/26/2011         101.623357
156        Volvo      S80  ...     11/14/2011          85.735655

[157 rows x 16 columns]

In [ ]:
# Group by
df_grpby = car_sales.groupby("Vehicle_type")
df_grpby

In [ ]:
# Commonly used functions of group by
df_grpby.first()

             Manufacturer     Model  ...  Latest_Launch  Power_perf_factor
Vehicle_type                         ...
Car              Cadillac  Escalade  ...      4/17/2012         109.509117
Passenger           Acura   Integra  ...       2/2/2012          58.280150

[2 rows x 15 columns]

In [ ]:
df_grpby.last()

             Manufacturer         Model  ...  Latest_Launch  Power_perf_factor
Vehicle_type                             ...
Car                Toyota  Land Cruiser  ...      9/25/2011         102.528984
Passenger           Volvo           S80  ...     11/14/2011          85.735655

[2 rows x 15 columns]

In [ ]:
df_grpby['Sales_in_thousands'].max()

Vehicle_type
Car          540.561
Passenger    247.994
Name: Sales_in_thousands, dtype: float64

In [ ]:
df_grpby['Sales_in_thousands'].min()

Vehicle_type
Car          9.126
Passenger    0.110
Name: Sales_in_thousands, dtype: float64

In [ ]:
df_grpby['Sales_in_thousands'].mean()

Vehicle_type
Car          80.622293
Passenger    43.234345
Name: Sales_in_thousands, dtype: float64

In [ ]:
# iterating groups
df_grpby.groups

{'Car': Int64Index([ 18,  33,  40,  41,  42,  43,  44,  45,  52,  53,  54,  55,  56,
              59,  60,  61,  67,  68,  69,  74,  75,  78,  84,  85,  90,  91,
             100, 104, 105, 106, 107, 112, 113, 116, 123, 135, 140, 141, 142,
             143, 144],
            dtype='int64'),
 'Passenger': Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
             ...
             147, 148, 149, 150, 151, 152, 153, 154, 155, 156],
            dtype='int64', length=116)}

In [ ]:
for v_type, grpby_df in df_grpby:
  print(v_type)
  print(grpby_df)

Car
    Manufacturer           Model  ...  Latest_Launch  Power_perf_factor
18      Cadillac        Escalade  ...      4/17/2012         109.509117
33      Chrysler  Town & Country  ...      7/13/2011                NaN
40         Dodge      Ram Pickup  ...       3/6/2012          90.211700
41         Dodge       Ram Wagon  ...       1/6/2012          71.135292
42         Dodge         Ram Van  ...      7/26/2012          70.078322
43         Dodge          Dakota  ...     11/25/2011          49.645002
44         Dodge         Durango  ...      6/27/2012          92.854125
45         Dodge         Caravan  ...       9/1/2011          61.227000
52          Ford        Explorer  ...      4/25/2012          87.635496
53          Ford        Windstar  ...      2/25/2012          62.095048
54          Ford      Expedition  ...      9/14/2012         100.024802
55          Ford          Ranger  ...      1/14/2012          47.389531
56          Ford        F-Series  ...      8/16/2012          89.401935
59         Honda            CR-V  ...      3/21/2012          60.087967
60         Honda        Passport  ...      10/9/2012          83.602501
61         Honda         Odyssey  ...       2/8/2012          85.217691
67          Jeep        Wrangler  ...       3/4/2012          48.672898
68          Jeep        Cherokee  ...      10/5/2012          76.584440
69          Jeep  Grand Cherokee  ...     12/10/2011          80.387779
74         Lexus           LX470  ...     10/30/2012         105.760458
75         Lexus           RX300  ...       1/4/2012          91.943802
78       Lincoln       Navigator  ...     12/23/2012         123.972047
84    Mitsubishi         Montero  ...      1/17/2012          83.920815
85    Mitsubishi   Montero Sport  ...      5/18/2012          70.660942
90       Mercury     Mountaineer  ...      2/13/2008          85.949744
91       Mercury        Villager  ...     10/20/2009          69.671461
100   Mercedes-B         M-Class  ...      2/10/2011          90.495532
104       Nissan           Quest  ...       3/7/2011          71.171664
105       Nissan      Pathfinder  ...      9/25/2011          72.290355
106       Nissan          Xterra  ...      1/24/2011          69.782944
107       Nissan        Frontier  ...      8/27/2011          67.889271
112   Oldsmobile         Bravada  ...      9/21/2011          80.511673
113   Oldsmobile      Silhouette  ...      6/25/2011          76.096570
116     Plymouth         Voyager  ...      4/24/2011          60.951185
123      Pontiac         Montana  ...      7/22/2012          76.208440
135       Subaru        Forester  ...      9/10/2012          66.762943
140       Toyota          Tacoma  ...       8/1/2011          55.297117
141       Toyota          Sienna  ...      10/5/2012          78.027219
142       Toyota            RAV4  ...       5/6/2011          51.955109
143       Toyota         4Runner  ...       3/7/2011          62.355577
144       Toyota    Land Cruiser  ...      9/25/2011         102.528984

[41 rows x 16 columns]
Passenger
    Manufacturer    Model  ...  Latest_Launch  Power_perf_factor
0          Acura  Integra  ...       2/2/2012          58.280150
1          Acura       TL  ...       6/3/2011          91.370778
2          Acura       CL  ...       1/4/2012                NaN
3          Acura       RL  ...      3/10/2011          91.389779
4           Audi       A4  ...      10/8/2011          62.777639
..           ...      ...  ...            ...                ...
152        Volvo      V40  ...      9/21/2011          66.498812
153        Volvo      S70  ...     11/24/2012          70.654495
154        Volvo      V70  ...      6/25/2011          71.155978
155        Volvo      C70  ...      4/26/2011         101.623357
156        Volvo      S80  ...     11/14/2011          85.735655

[116 rows x 16 columns]

In [ ]:
# Get information about a specific group
df_grpby.get_group("Car")

    Manufacturer           Model  ...  Latest_Launch  Power_perf_factor
18      Cadillac        Escalade  ...      4/17/2012         109.509117
33      Chrysler  Town & Country  ...      7/13/2011                NaN
40         Dodge      Ram Pickup  ...       3/6/2012          90.211700
41         Dodge       Ram Wagon  ...       1/6/2012          71.135292
42         Dodge         Ram Van  ...      7/26/2012          70.078322
43         Dodge          Dakota  ...     11/25/2011          49.645002
44         Dodge         Durango  ...      6/27/2012          92.854125
45         Dodge         Caravan  ...       9/1/2011          61.227000
52          Ford        Explorer  ...      4/25/2012          87.635496
53          Ford        Windstar  ...      2/25/2012          62.095048
54          Ford      Expedition  ...      9/14/2012         100.024802
55          Ford          Ranger  ...      1/14/2012          47.389531
56          Ford        F-Series  ...      8/16/2012          89.401935
59         Honda            CR-V  ...      3/21/2012          60.087967
60         Honda        Passport  ...      10/9/2012          83.602501
61         Honda         Odyssey  ...       2/8/2012          85.217691
67          Jeep        Wrangler  ...       3/4/2012          48.672898
68          Jeep        Cherokee  ...      10/5/2012          76.584440
69          Jeep  Grand Cherokee  ...     12/10/2011          80.387779
74         Lexus           LX470  ...     10/30/2012         105.760458
75         Lexus           RX300  ...       1/4/2012          91.943802
78       Lincoln       Navigator  ...     12/23/2012         123.972047
84    Mitsubishi         Montero  ...      1/17/2012          83.920815
85    Mitsubishi   Montero Sport  ...      5/18/2012          70.660942
90       Mercury     Mountaineer  ...      2/13/2008          85.949744
91       Mercury        Villager  ...     10/20/2009          69.671461
100   Mercedes-B         M-Class  ...      2/10/2011          90.495532
104       Nissan           Quest  ...       3/7/2011          71.171664
105       Nissan      Pathfinder  ...      9/25/2011          72.290355
106       Nissan          Xterra  ...      1/24/2011          69.782944
107       Nissan        Frontier  ...      8/27/2011          67.889271
112   Oldsmobile         Bravada  ...      9/21/2011          80.511673
113   Oldsmobile      Silhouette  ...      6/25/2011          76.096570
116     Plymouth         Voyager  ...      4/24/2011          60.951185
123      Pontiac         Montana  ...      7/22/2012          76.208440
135       Subaru        Forester  ...      9/10/2012          66.762943
140       Toyota          Tacoma  ...       8/1/2011          55.297117
141       Toyota          Sienna  ...      10/5/2012          78.027219
142       Toyota            RAV4  ...       5/6/2011          51.955109
143       Toyota         4Runner  ...       3/7/2011          62.355577
144       Toyota    Land Cruiser  ...      9/25/2011         102.528984

[41 rows x 15 columns]

In [ ]:
# Get detailed view of the group
df_grpby.describe()

             Sales_in_thousands             ... Power_perf_factor
                          count       mean  ...               75%         max
Vehicle_type                                ...
Car                        41.0  80.622293  ...         88.077106  123.972047
Passenger                 116.0  43.234345  ...         90.399299  188.144323

[2 rows x 96 columns]

In [ ]:
# check length of the group
len(df_grpby.get_group("Car"))

41

In [ ]:
len(df_grpby) # no of groups

2

In [ ]:
# Group by with multi-index
#car_sales.columns
df_mi = car_sales.set_index(['Vehicle_type','Model'])
df_mi

                     Manufacturer  ...  Power_perf_factor
Vehicle_type Model                 ...
Passenger    Integra        Acura  ...          58.280150
             TL             Acura  ...          91.370778
             CL             Acura  ...                NaN
             RL             Acura  ...          91.389779
             A4              Audi  ...          62.777639
...                           ...  ...                ...
             V40            Volvo  ...          66.498812
             S70            Volvo  ...          70.654495
             V70            Volvo  ...          71.155978
             C70            Volvo  ...         101.623357
             S80            Volvo  ...          85.735655

[157 rows x 14 columns]

In [ ]:
# aggregation
df_grpby.size()

Vehicle_type
Car           41
Passenger    116
dtype: int64

In [ ]:
df_grpby['Sales_in_thousands'].mean()

Vehicle_type
Car          80.622293
Passenger    43.234345
Name: Sales_in_thousands, dtype: float64

In [ ]:
# multiple aggregation at once
import numpy as np
df_grpby.agg([np.sum, np.mean, np.std])

             Sales_in_thousands             ... Power_perf_factor
                            sum       mean  ...              mean        std
Vehicle_type                                ...
Car                    3305.514  80.622293  ...         76.999112  17.440817
Passenger              5015.184  43.234345  ...         77.059062  27.384276

[2 rows x 36 columns]

In [ ]:
# renaming columns for aggregation function
df_grpby.agg([np.sum, np.mean, np.std]).rename(columns={"sum":"Total", "mean":"Average", "std":"Standard Deviation"})
# named aggregation, custom agg function

             Sales_in_thousands             ... Power_perf_factor
                          Total    Average  ...           Average Standard Deviation
Vehicle_type                                ...
Car                    3305.514  80.622293  ...         76.999112          17.440817
Passenger              5015.184  43.234345  ...         77.059062          27.384276

[2 rows x 36 columns]

In [ ]:
# Transform
df_g2 = car_sales.groupby("Vehicle_type")['Sales_in_thousands'].sum().rename("Total_sales").reset_index()
df_g2

  Vehicle_type  Total_sales
0          Car     3305.514
1    Passenger     5015.184

In [ ]:
df_merge = car_sales.merge(df_g2)

In [ ]:
df_merge["%"] = df_merge["Sales_in_thousands"] / df_merge["Total_sales"]
df_merge.head(10)

  Manufacturer    Model  ...  Total_sales         %
0        Acura  Integra  ...     5015.184  0.003374
1        Acura       TL  ...     5015.184  0.007853
2        Acura       CL  ...     5015.184  0.002814
3        Acura       RL  ...     5015.184  0.001712
4         Audi       A4  ...     5015.184  0.004067
5         Audi       A6  ...     5015.184  0.003745
6         Audi       A8  ...     5015.184  0.000275
7          BMW     323i  ...     5015.184  0.003937
8          BMW     328i  ...     5015.184  0.001841
9          BMW     528i  ...     5015.184  0.003495

[10 rows x 18 columns]

In [ ]:
# using transform()
df_merge["Total_s"] = car_sales.groupby("Vehicle_type")['Sales_in_thousands'].transform('sum')
df_merge["Mean_sales"] = car_sales.groupby("Vehicle_type")['Sales_in_thousands'].transform('mean')
df_merge.head(10)

  Manufacturer    Model  Sales_in_thousands  ...         %   Total_s  Mean_sales
0        Acura  Integra              16.919  ...  0.003374  5015.184   43.234345
1        Acura       TL              39.384  ...  0.007853  5015.184   43.234345
2        Acura       CL              14.114  ...  0.002814  5015.184   43.234345
3        Acura       RL               8.588  ...  0.001712  5015.184   43.234345
4         Audi       A4              20.397  ...  0.004067  5015.184   43.234345
5         Audi       A6              18.780  ...  0.003745  5015.184   43.234345
6         Audi       A8               1.380  ...  0.000275  5015.184   43.234345
7          BMW     323i              19.747  ...  0.003937  5015.184   43.234345
8          BMW     328i               9.231  ...  0.001841  5015.184   43.234345
9          BMW     528i              17.527  ...  0.003495  5015.184   43.234345

[10 rows x 20 columns]

In [ ]:
#windows functions
import pandas as pd
import numpy as np

price = np.random.randn(10,1)
days = pd.date_range('1/1/2020', periods=10)

df = pd.DataFrame(price, index=days, columns=['StockPrice'])
df

            StockPrice
2020-01-01   -2.958993
2020-01-02   -1.692103
2020-01-03    1.030309
2020-01-04   -0.754927
2020-01-05    0.299329
2020-01-06    1.085077
2020-01-07    0.431546
2020-01-08   -0.309753
2020-01-09   -0.435297
2020-01-10   -0.334580

In [ ]:
df['prev_price'] = df['StockPrice'].shift(1)
df

            StockPrice  prev_price
2020-01-01   -2.958993         NaN
2020-01-02   -1.692103   -2.958993
2020-01-03    1.030309   -1.692103
2020-01-04   -0.754927    1.030309
2020-01-05    0.299329   -0.754927
2020-01-06    1.085077    0.299329
2020-01-07    0.431546    1.085077
2020-01-08   -0.309753    0.431546
2020-01-09   -0.435297   -0.309753
2020-01-10   -0.334580   -0.435297

In [ ]:
df['daily_change'] = df['StockPrice'] / df['prev_price'] - 1
df

            StockPrice  prev_price  daily_change
2020-01-01   -2.958993         NaN           NaN
2020-01-02   -1.692103   -2.958993     -0.428149
2020-01-03    1.030309   -1.692103     -1.608893
2020-01-04   -0.754927    1.030309     -1.732720
2020-01-05    0.299329   -0.754927     -1.396501
2020-01-06    1.085077    0.299329      2.625026
2020-01-07    0.431546    1.085077     -0.602290
2020-01-08   -0.309753    0.431546     -1.717776
2020-01-09   -0.435297   -0.309753      0.405305
2020-01-10   -0.334580   -0.435297     -0.231376

In [ ]:
df['expanding_mean'] = df['daily_change'].expanding().mean()
df

            StockPrice  prev_price  daily_change  expanding_mean
2020-01-01   -2.958993         NaN           NaN             NaN
2020-01-02   -1.692103   -2.958993     -0.428149       -0.428149
2020-01-03    1.030309   -1.692103     -1.608893       -1.018521
2020-01-04   -0.754927    1.030309     -1.732720       -1.256587
2020-01-05    0.299329   -0.754927     -1.396501       -1.291566
2020-01-06    1.085077    0.299329      2.625026       -0.508247
2020-01-07    0.431546    1.085077     -0.602290       -0.523921
2020-01-08   -0.309753    0.431546     -1.717776       -0.694472
2020-01-09   -0.435297   -0.309753      0.405305       -0.557000
2020-01-10   -0.334580   -0.435297     -0.231376       -0.520819

In [ ]:
df['rolling_mean'] = df['daily_change'].rolling(3).mean()
df

            StockPrice  prev_price  daily_change  expanding_mean  rolling_mean
2020-01-01   -2.958993         NaN           NaN             NaN           NaN
2020-01-02   -1.692103   -2.958993     -0.428149       -0.428149           NaN
2020-01-03    1.030309   -1.692103     -1.608893       -1.018521           NaN
2020-01-04   -0.754927    1.030309     -1.732720       -1.256587     -1.256587
2020-01-05    0.299329   -0.754927     -1.396501       -1.291566     -1.579371
2020-01-06    1.085077    0.299329      2.625026       -0.508247     -0.168065
2020-01-07    0.431546    1.085077     -0.602290       -0.523921      0.208745
2020-01-08   -0.309753    0.431546     -1.717776       -0.694472      0.101654
2020-01-09   -0.435297   -0.309753      0.405305       -0.557000     -0.638254
2020-01-10   -0.334580   -0.435297     -0.231376       -0.520819     -0.514616

In [ ]:
# filter
df_filter = car_sales.filter(items=['Vehicle_type','Sales_in_thousands'])
df_filter

    Vehicle_type  Sales_in_thousands
0      Passenger              16.919
1      Passenger              39.384
2      Passenger              14.114
3      Passenger               8.588
4      Passenger              20.397
..           ...                 ...
152    Passenger               3.545
153    Passenger              15.245
154    Passenger              17.531
155    Passenger               3.493
156    Passenger              18.969

[157 rows x 2 columns]

In [ ]:
df_regex = car_sales.filter(regex='e$', axis=1)
df_regex

     four_year_resale_value Vehicle_type  Engine_size  Wheelbase
0                    16.360    Passenger          1.8      101.2
1                    19.875    Passenger          3.2      108.1
2                    18.225    Passenger          3.2      106.9
3                    29.725    Passenger          3.5      114.6
4                    22.255    Passenger          1.8      102.6
..                      ...          ...          ...        ...
152                     NaN    Passenger          1.9      100.5
153                     NaN    Passenger          2.4      104.9
154                     NaN    Passenger          2.4      104.9
155                     NaN    Passenger          2.3      104.9
156                     NaN    Passenger          2.9      109.9

[157 rows x 4 columns]

In [1]:
# join / merge / concat
# join = left, right, inner, outer 
import pandas as pd
df1 = pd.DataFrame({'Key':['X','Y'],
                    'A':['A1','A2'],
                    'B':['B1','B2']}).set_index('Key')
df1

      A   B
Key
X    A1  B1
Y    A2  B2

In [2]:
df2 = pd.DataFrame({'Key':['X','Z'],
                    'A':['A1','A2'],
                    'C':['C1','C2']}).set_index('Key')
df2

      A   C
Key
X    A1  C1
Z    A2  C2

In [3]:
df1.join(df2, lsuffix='_df1', rsuffix='_df2', how='left')

    A_df1   B A_df2    C
Key
X      A1  B1    A1   C1
Y      A2  B2   NaN  NaN

In [4]:
df1.join(df2, lsuffix='_df1', rsuffix='_df2', how='right')

    A_df1    B A_df2   C
Key
X      A1   B1    A1  C1
Z     NaN  NaN    A2  C2

In [5]:
df1.join(df2, lsuffix='_df1', rsuffix='_df2', how='inner')

    A_df1   B A_df2   C
Key
X      A1  B1    A1  C1

In [6]:
df1.join(df2, lsuffix='_df1', rsuffix='_df2', how='outer')

    A_df1    B A_df2    C
Key
X      A1   B1    A1   C1
Y      A2   B2   NaN  NaN
Z     NaN  NaN    A2   C2

In [8]:
# merge
df1.merge(df2, on='A')

    A   B   C
0  A1  B1  C1
1  A2  B2  C2

In [9]:
df1.merge(df2, on='A',left_index=True)

      A   B   C
Key
X    A1  B1  C1
Z    A2  B2  C2

In [10]:
df1.merge(df2, on='A',left_index=True, how='left')

      A   B   C
Key
X    A1  B1  C1
Z    A2  B2  C2

In [11]:
df1.merge(df2, on='A',left_index=True, how='right')

       A    B   C
Key
X    NaN  NaN  C1
Z    NaN  NaN  C2

In [12]:
df1.merge(df2, on='A',left_index=True, how='right', right_index=True)

       A    B   C
Key
X     A1   B1  C1
Z    NaN  NaN  C2

In [14]:
# concat
pd.concat([df1,df2])

      A    B    C
Key
X    A1   B1  NaN
Y    A2   B2  NaN
X    A1  NaN   C1
Z    A2  NaN   C2

In [16]:
pd.concat([df1,df2], join='inner', axis=1)

      A   B   A   C
Key
X    A1  B1  A1  C1

In [17]:
pd.concat([df1,df2], join='inner', axis=0)

      A
Key
X    A1
Y    A2
X    A1
Z    A2

In [18]:
# apply
import pandas as pd
import numpy as np
temp = np.arange(90,150)
df = pd.DataFrame(temp,columns=['Fahrenheit'])
df

    Fahrenheit
0           90
1           91
2           92
3           93
4           94
5           95
6           96
7           97
8           98
9           99
10         100
11         101
12         102
13         103
14         104
15         105
16         106
17         107
18         108
19         109
20         110
21         111
22         112
23         113
24         114
25         115
26         116
27         117
28         118
29         119
30         120
31         121
32         122
33         123
34         124
35         125
36         126
37         127
38         128
39         129
40         130
41         131
42         132
43         133
44         134
45         135
46         136
47         137
48         138
49         139
50         140
51         141
52         142
53         143
54         144
55         145
56         146
57         147
58         148
59         149

In [22]:
def convertToCelsius(ftemp):
  return ((ftemp - 32) * 5/9)

In [23]:
df['Celsius'] = df['Fahrenheit'].apply(convertToCelsius)

In [24]:
df

    Fahrenheit    Celsius
0           90  32.222222
1           91  32.777778
2           92  33.333333
3           93  33.888889
4           94  34.444444
5           95  35.000000
6           96  35.555556
7           97  36.111111
8           98  36.666667
9           99  37.222222
10         100  37.777778
11         101  38.333333
12         102  38.888889
13         103  39.444444
14         104  40.000000
15         105  40.555556
16         106  41.111111
17         107  41.666667
18         108  42.222222
19         109  42.777778
20         110  43.333333
21         111  43.888889
22         112  44.444444
23         113  45.000000
24         114  45.555556
25         115  46.111111
26         116  46.666667
27         117  47.222222
28         118  47.777778
29         119  48.333333
30         120  48.888889
31         121  49.444444
32         122  50.000000
33         123  50.555556
34         124  51.111111
35         125  51.666667
36         126  52.222222
37         127  52.777778
38         128  53.333333
39         129  53.888889
40         130  54.444444
41         131  55.000000
42         132  55.555556
43         133  56.111111
44         134  56.666667
45         135  57.222222
46         136  57.777778
47         137  58.333333
48         138  58.888889
49         139  59.444444
50         140  60.000000
51         141  60.555556
52         142  61.111111
53         143  61.666667
54         144  62.222222
55         145  62.777778
56         146  63.333333
57         147  63.888889
58         148  64.444444
59         149  65.000000

In [ ]:
# Data Frame reshape